app/views/events/show.html.erb

SELECT "rsvps".* FROM "rsvps" WHERE (event_id = 9 AND user_id = 1) LIMIT 1
---

<%  if user_signed_in? and Rsvp.where("event_id = ? AND user_id = ?", @event.id, current_user.id).length > 0 %>