app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" ORDER BY events.created_at DESC

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "1"]]

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "1"]]

  def create
    if user_signed_in?
      @event = Event.new(params[:event])
      @event.user_id = current_user.id

      respond_to do |format|
        if @event.save
---
INSERT INTO "events" ("contact", "created_at", "description", "latitude", "location", "longitude", "menu", "name", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])
    if (not user_signed_in? ) or (not current_user.id == @event.user_id)
      redirect_to root_path, notice: "You must sign in as this user to update their event."
    else
      respond_to do |format|
        if @event.update_attributes(params[:event])
          @greeting = "Hello"
          @new_time = @event.time.to_s
          @name = @event.name
          @all_rsvps = Rsvp.where("event_id = ?", @event.id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "events" SET "name" = 'Super Cool Event 242', "description" = 'asdf asd', "time" = '2012-03-30 14:49:00.000000', "updated_at" = '2013-03-30 22:05:20.900867' WHERE "events"."id" = 11
SELECT "rsvps".* FROM "rsvps" WHERE (event_id = 11)
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def destroy
    @event = Event.find(params[:id])
    if (not user_signed_in? ) or (not current_user.id == @event.user_id)
      redirect_to root_path, notice: "You must sign in as this user to update their event."
    else
      @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 ORDER BY events.created_at DESC LIMIT 1
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]