app/controllers/rsvps_controller.rb

  def edit
    @rsvp = Rsvp.find(params[:id])
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @rsvp = Rsvp.new(params[:rsvp])

    if(not @rsvp.user_id == current_user.id)
      redirect_to "/events/"+ @rsvp.event_id.to_s , notice: "Don't try signing in for the wrong user."
    end

    respond_to do |format|
      if @rsvp.save
---
INSERT INTO "rsvps" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 30 Mar 2013 11:09:32 UTC +00:00], ["event_id", 4], ["updated_at", Sat, 30 Mar 2013 11:09:32 UTC +00:00], ["user_id", 1]]

  def destroy
    @rsvp = Rsvp.find(params[:id])
    @rsvp.destroy
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "rsvps" WHERE "rsvps"."id" = ?  [["id", 1]]