app/controllers/static_pages_controller.rb

SELECT "events".* FROM "events" ORDER BY events.created_at DESC, created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def home
    @feed_items = Event.paginate(page: params[:page], :per_page => 10, :order => 'created_at desc')

SELECT "events".* FROM "events" ORDER BY events.created_at DESC, created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def all_events
    @feed_items = Event.paginate(page: params[:page], :per_page => 10, :order => 'created_at desc')