app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 10, :order => 'id desc')
---
SELECT "users".* FROM "users" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])

    @user_events = Event.where("user_id =" + @user.id.to_s)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "index"]]
SELECT "events".* FROM "events" WHERE (user_id = 2) ORDER BY events.created_at DESC